using namespace std;
#include <vector>

//找规律 细致条件分析
//数字分类成三类
//1121
//112
//1开始,开始的轮流拿1要比2多2个,然后因为还得拿个2凑3才输所以要多1个2，所以总共1要比2多1个,v[1]<v[2]+2-1则A赢,
//类推，1开始，v[1]>=v[2]+2+1则B赢,v[1]==v[2]+2||v[1]==v[2]+1则B赢且与v[0]无关
//2212
//221
//2开始,v[2]<v[1]+2-1则A赢,v[2]>=v[1]+2+1则B赢,v[2]==v[1]+2||v[2]==v[1]+1则B赢且与v[0]无关
//3的奇偶性改变结果，奇数改变，偶数不改变。
class Solution {
public:
    bool stoneGameIX(vector<int>& stones) {
        int v[3]{};
        for (int& e : stones) {
            v[e % 3]++;
        }
        return v[1] && (v[1] < v[2] + 1 && v[0] % 2 == 0 || v[1] >= v[2] + 3 && v[0] % 2) || v[2] && (v[2] < v[1] + 1 && v[0] % 2 == 0 || v[2] >= v[1] + 3 && v[0] % 2);
    }
};